/*
--------------------------------------------------
| Generic Type
--------------------------------------------------
| - Generic Type คือชนิดข้อมูลที่กำหนดภายหลัง
| - คือ (struct, enum, impl) ที่ทำงานกับหลายชนิดข้อมูลได้
|   โดยไม่ต้องเขียนซ้ำหลายรอบ
| - ตัวอย่างง่าย ๆ
--------------------------------------------------
*/

fn print_item<T>(item: T) {
    println!("Got something!");
}
// T คือ Generic Type Parameter
// แทนที่จะบังคับว่า item ต้องเป็น i32, String, หรืออื่น ๆ
// เราบอกแค่ "อะไรก็ได้" (compiler ตรวจสอบภายหลังตอนเรียกใช้จริง)

print_item(42);         // T = i32
print_item("hello");    // T = &str
print_item(String::from("Rust")); // T = String